#!/usr/bin/env python
# coding: utf-8

# ### **데이터분석으로 나만의 전략 만들기**           
# 
# <br>
# 주식 데이터로 데이터분석를 하는 과정을 보험회사 사례를 활용하여 풀어보겠습니다. 먼저 문제점은 주식으로 수익을 내고 싶은데 손실이 난다는 것입니다. 주식 투자는 기간에 따라 장기투자와 단기투자로 나눌 수 있고, 그 중 단기 투자가 데이터 분석에는 더 적합합니다. 왜냐하면 데이터 분석은 통계적인 접근이 필요한데 단기 투자가 많은 테스트 결과를 확보할 수 있기 때문입니다. 장기투자의 경우는 가치투자에 더 가까습니다. 테스트 결과을 얻는데 까지 시간이 많이 필요합니다. 데이터분석의 가치를 통계적으로 보여주기는 단기 투자가 사례로 더 적절합니다.</br>     
# <br>
# 보험회사 사례의 과정을 따라 데이터 분석을 해 보겠습니다.
# 
# >1. 문제점 파악과 정의
# >2. 정보 수집 및 전문가 인터뷰
# >3. 가설 설정
# >4. 가설 검증을 위한 데이터 수집 및 분석
# >5. 검정과정에서 발견된 결과물을 이용하여 해결책 개발
# >6. 해결책 테스트 및 해결책의 효과 측정

# <br> 문제의 정의부터 해결책 개발까지의 과정을 도식화해 보았습니다. 문제를 먼저 구조화하고 가설을 만들면 각 가설 검증이 왜 필요한지 이해하기 쉽고, 가설들의 중복을 피할 수 있습니다.

# <img src="../_images/Solving_Process.png" width="800" height="450"></img>

# <img src="../_images/Problem_Definition.png" width="800" height="450"></img>

# <img src="../_images/Problem_Structure.png" width="800" height="450"></img>

# <img src="../_images/Hypothesis_Development.png" width="800" height="450"></img>

# <img src="../_images/Solution_Development.png" width="800" height="450"></img>
